## 957818836222: Alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 10 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.billing_change_over_threshold will be created
  + resource "aws_cloudwatch_metric_alarm" "billing_change_over_threshold" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Estimated billing change greater than threshold in 6 hour period"
      + alarm_name                            = "BillingChangeOverThreshold"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "current"
          + label       = "Current charges"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "Currency" = "USD"
                }
              + metric_name = "EstimatedCharges"
              + namespace   = "AWS/Billing"
              + period      = 21600
              + stat        = "Maximum"
            }
        }
      + metric_query {
          + expression  = "ABS(100 * delta/previous)"
          + id          = "percent_change"
          + label       = "Percent change"
          + return_data = true
        }
      + metric_query {
          + expression  = "RATE(current) * PERIOD(current)"
          + id          = "delta"
          + label       = "Delta"
          + return_data = false
        }
      + metric_query {
          + expression  = "current - delta"
          + id          = "previous"
          + label       = "Previous charges"
          + return_data = false
        }
    }

  # aws_kms_key.sns_cloudwatch_us_east will be created
  + resource "aws_kms_key" "sns_cloudwatch_us_east" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for CloudWatch SNS topic"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::957818836222:root"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "CostCentre" = "cbs-957818836222"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "cbs-957818836222"
          + "Terraform"  = "true"
        }
    }

  # aws_sns_topic.cloudwatch_alarm_us_east will be created
  + resource "aws_sns_topic" "cloudwatch_alarm_us_east" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "cloudwatch_alarm_cbs"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCentre" = "cbs-957818836222"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "cbs-957818836222"
          + "Terraform"  = "true"
        }
    }

  # aws_sns_topic_subscription.cloudwatch_alarm_us_east will be created
  + resource "aws_sns_topic_subscription" "cloudwatch_alarm_us_east" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.notify_slack.data.aws_iam_policy_document.notify_slack_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "notify_slack_lambda"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.notify_slack.aws_cloudwatch_log_group.notify_slack_lambda will be created
  + resource "aws_cloudwatch_log_group" "notify_slack_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/notify_slack_cbs"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "cbs-957818836222"
        }
      + tags_all          = {
          + "CostCentre" = "cbs-957818836222"
        }
    }

  # module.notify_slack.aws_iam_policy.notify_slack_lambda will be created
  + resource "aws_iam_policy" "notify_slack_lambda" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "NotifySlackLambda-notify_slack_cbs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.notify_slack.aws_iam_role.notify_slack_lambda will be created
  + resource "aws_iam_role" "notify_slack_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "NotifySlackLambda-notify_slack_cbs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.notify_slack.aws_iam_role_policy_attachment.notify_slack_lambda will be created
  + resource "aws_iam_role_policy_attachment" "notify_slack_lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "NotifySlackLambda-notify_slack_cbs"
    }

  # module.notify_slack.aws_lambda_function.notify_slack will be created
  + resource "aws_lambda_function" "notify_slack" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Lambda function to post CloudWatch alarm notifications to a Slack channel."
      + filename                       = "/tmp/notify_slack.py.zip"
      + function_name                  = "notify_slack_cbs"
      + handler                        = "notify_slack.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "FipuaAUTHLWpYfowItg9o9BtNFUGbGVXXpLMyzFzTZY="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "cbs-957818836222"
        }
      + tags_all                       = {
          + "CostCentre" = "cbs-957818836222"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "LOG_EVENTS"        = "True"
              + "PROJECT_NAME"      = "957818836222"
              + "SLACK_WEBHOOK_URL" = (sensitive)
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.notify_slack.aws_lambda_permission.notify_slack[0] will be created
  + resource "aws_lambda_permission" "notify_slack" {
      + action        = "lambda:InvokeFunction"
      + function_name = "notify_slack_cbs"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromSNS-notify_slack_cbs-0"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.billing_change_over_threshold"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_cloudwatch_log_group.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_iam_policy.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_iam_role.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_lambda_function.notify_slack"]

13 tests, 8 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
